In [ ]:
import pandas as pd
import numpy as np
import matplotlib
from matplotlib import pyplot as plt
dataframe = pd.read_csv('data_preprocessing.csv')
dataframe.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [ ]:
# counting null values
dataframe.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [281]:
# checking the main category
dataframe['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [282]:
# handling categorical data
country_one_hot_encoded = pd.get_dummies(dataframe['Country'])

In [283]:
country_one_hot_encoded.head()

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       0        1      0

In [284]:
dataframe = pd.concat([dataframe,country_one_hot_encoded], axis =1)

In [263]:
dataframe.head()

   Country   Age   Salary Purchased  France  Germany  Spain
0   France  44.0  72000.0        No       1        0      0
1    Spain  27.0  48000.0       Yes       0        0      1
2  Germany  30.0  54000.0        No       0        1      0
3    Spain  38.0  61000.0        No       0        0      1
4  Germany  40.0      NaN       Yes       0        1      0

In [122]:
# Salary_germany = list(dataframe.Salary.groupby(dataframe['Country']=='Germany'))

In [285]:
def find_mean(dataframe, country, col):
    try:
        object_null= np.array([])
        for counter in range(0, len(dataframe)):
            if dataframe[country][counter] == 1:
                object_null = np.append(object_null, dataframe[col][counter])
        mean=0
        count_null=0
        for item in object_null: 
            if not np.isnan(item):
                mean += item
            else:
                count_null += 1
        mean /= (len(object_null)-count_null)
        return mean
    except Exception as e:
        print("process stopped because of", e)

In [286]:
# handling missing values
# finding the countries where the salary is null
for counter in range(0, len(dataframe)):
    if np.isnan(dataframe['Salary'][counter]):
        print(dataframe.loc[counter,['Country','Salary']])

Country    Germany
Salary         NaN
Name: 4, dtype: object

In [287]:
salary_Germany_notnull_mean = find_mean(dataframe, 'Germany', 'Salary')

In [288]:
# printing the mean
salary_Germany_notnull_mean

68500.0

In [289]:
dataframe['Salary'] = dataframe.Salary.fillna(salary_Germany_notnull_mean)

In [290]:
dataframe.isna().sum()

Country      0
Age          1
Salary       0
Purchased    0
France       0
Germany      0
Spain        0
dtype: int64

In [291]:
# finding the countries where the Age is null
for counter in range(0,len(dataframe)):
    if np.isnan(dataframe['Age'][counter]):
        print(dataframe.loc[counter,['Country','Age']])

Country    Spain
Age          NaN
Name: 6, dtype: object

In [292]:
age_Spain_notnull_mean = np.round(find_mean(dataframe,'Spain','Age'))

In [293]:
age_Spain_notnull_mean

32.0

In [294]:
# Assigning the filled handled missing age to data frame
dataframe['Age'] = dataframe.Age.fillna(age_Spain_notnull_mean)

In [295]:
dataframe.isna().sum()
# completed missing values handling

Country      0
Age          0
Salary       0
Purchased    0
France       0
Germany      0
Spain        0
dtype: int64

In [296]:
# Feature Scaling converting the labels to integers or bringing them on a same scale
dataframe.Purchased.replace(['Yes', 'No'], [1, 0], inplace=True)

In [ ]:
length = len(dataframe)
length -= 1
testdata = dataframe.loc[length, ]

In [ ]:
length -= 1
dataframe = dataframe.loc[0:length, ]

In [301]:
dataframe

   Country   Age   Salary  Purchased  France  Germany  Spain
0   France  44.0  72000.0          0       1        0      0
1    Spain  27.0  48000.0          1       0        0      1
2  Germany  30.0  54000.0          0       0        1      0
3    Spain  38.0  61000.0          0       0        0      1
4  Germany  40.0  68500.0          1       0        1      0
5   France  35.0  58000.0          1       1        0      0
6    Spain  32.0  52000.0          0       0        0      1
7   France  48.0  79000.0          1       1        0      0
8  Germany  50.0  83000.0          0       0        1      0

In [303]:
dataframe

   Country   Age   Salary  Purchased  France  Germany  Spain
0   France  44.0  72000.0          0       1        0      0
1    Spain  27.0  48000.0          1       0        0      1
2  Germany  30.0  54000.0          0       0        1      0
3    Spain  38.0  61000.0          0       0        0      1
4  Germany  40.0  68500.0          1       0        1      0
5   France  35.0  58000.0          1       1        0      0
6    Spain  32.0  52000.0          0       0        0      1
7   France  48.0  79000.0          1       1        0      0
8  Germany  50.0  83000.0          0       0        1      0